Revit 2027 API
ParameterTypeId.StructuralFamilyCodeName Property
 "Code Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralFamilyCodeName { get; }
Public Shared ReadOnly Property StructuralFamilyCodeName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralFamilyCodeName {
	ForgeTypeId^ get ();
}
static member StructuralFamilyCodeName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace